

export function AboutBio() {

	return (
		<section>
			<h2 className="text-2xl font-semibold text-primary mb-6">Привет!</h2>
			<div className="space-y-4 text-muted leading-relaxed">
				<p>
					Я разработчик, которому всегда было интересно разбираться в технологиях и создавать что-то своими руками.
				</p>
				<p>
					Основной фокус сейчас — frontend-разработка и создание современных интерфейсов на React. Мне нравится превращать идеи в работающие приложения, уделять внимание удобству использования, качеству кода и и постоянно развивать свои навыки, изучая лучшие практики разработки и подходы к созданию приложений.
				</p>
				<p>
					Мой путь в программировании проходил через разные направления: я изучал веб-разработку, backend, базы данных, работал с 1С и интересовался различными областями разработки. Такой опыт помогает мне шире смотреть на задачи и лучше понимать, как устроены приложения и отдельные части программных систем.
				</p>
				<p>
					Также у меня был опыт преподавания программирования детям. Это помогло мне развить умение объяснять сложные вещи простым языком и глубже понимать основы разработки.
				</p>
				<p>
					Я постоянно изучаю новые технологии, создаю собственные проекты и стараюсь применять знания на практике, превращая идеи в полезные и удобные приложения.
				</p>
			</div>
		</section>
	)
}